import type { OrderDetailOption } from "../model/detail-option";

/** Направление разрабатываемой документации. */
export const DESIGN_CATEGORIES: OrderDetailOption[] = [
  {
    value: "DP",
    label: "Дизайн-проекты",
  },
  {
    value: "PS",
    label: "Промышленные объекты",
  },
  {
    value: "GS",
    label: "Гражданские объекты",
  },
  {
    value: "OKN",
    label: "Объекты культурного наследия",
  },
  {
    value: "BIM",
    label: "BIM-моделирование",
  },
  {
    value: "KD",
    label: "Конструкторская документация",
  },
  {
    value: "NSO",
    label: "Нестандартное оборудование",
  },
];

/** Вид документации. */
export const DESIGN_DOCUMENTATION_KINDS: OrderDetailOption[] = [
  {
    value: "PD",
    label: "Проектная документация",
  },
  {
    value: "RD",
    label: "Рабочая документация",
  },
  {
    value: "TECH_REEQUIPMENT",
    label: "Техническое перевооружение",
  },
  {
    value: "CONSERVATION",
    label: "Консервация",
  },
  {
    value: "LIQUIDATION",
    label: "Ликвидация",
  },
  {
    value: "TECH_PROJECT",
    label: "Технический проект",
  },
];

/** Согласования и экспертизы. */
export const DESIGN_APPROVALS: OrderDetailOption[] = [
  {
    value: "STATE_EXPERTISE",
    label: "Государственная экспертиза",
  },
  {
    value: "ECO_EXPERTISE",
    label: "Государственная экологическая экспертиза",
  },
  {
    value: "EPB",
    label: "Экспертиза промышленной безопасности",
  },
  {
    value: "CKR_TPI",
    label: "Согласование в ЦКР (ТКР)-ТПИ Роснедр",
  },
];

/** Разделы проектной документации в заказе. */
export const DESIGN_SECTIONS: OrderDetailOption[] = [
  {
    value: "GIP",
    label: "Главный инженер проекта",
  },
  {
    value: "GAP",
    label: "Главный архитектор",
  },
  {
    value: "GT",
    label: "Специалист по генеральному плану и сооружениям транспорта",
  },
  {
    value: "GP",
    label: "Специалист по генеральному плану",
  },
  {
    value: "AD",
    label: "Специалист по автомобильным дорогам",
  },
  {
    value: "PZH",
    label: "Специалист по железнодорожным путям",
  },
  {
    value: "TR",
    label: "Специалист по сооружениям транспорта",
  },
  {
    value: "AS",
    label: "Специалист по архитектурно-строительным решениям",
  },
  {
    value: "AR",
    label: "Специалист по архитектурным решениям",
  },
  {
    value: "AI",
    label: "Специалист по интерьерам",
  },
  {
    value: "KZH",
    label: "Специалист по железобетонным конструкциям",
  },
  {
    value: "KM",
    label: "Специалист по металлическим конструкциям",
  },
  {
    value: "KMD",
    label: "Специалист по деталировочным металлическим конструкциям",
  },
  {
    value: "KD",
    label: "Специалист по деревянным конструкциям",
  },
  {
    value: "KDD",
    label: "Специалист по деталировочным деревянным конструкциям",
  },
  {
    value: "GR",
    label: "Специалист по гидротехническим решениям",
  },
  {
    value: "AZ",
    label: "Специалист по антикоррозионной защите конструкций зданий и сооружений",
  },
  {
    value: "ES",
    label: "Специалист по электроснабжению",
  },
  {
    value: "EN",
    label: "Специалист по наружному электроосвещению",
  },
  {
    value: "EO",
    label: "Специалист по внутреннему электрическому освещению",
  },
  {
    value: "EOM",
    label: "Специалист по силовому электрооборудованию и внутреннему электрическому освещению",
  },
  {
    value: "EV",
    label: "Специалист по воздушным линиям электропередачи",
  },
  {
    value: "EK",
    label: "Специалист по кабельным линиям электропередачи",
  },
  {
    value: "NVK",
    label: "Специалист по наружным сетям водоснабжения и канализации",
  },
  {
    value: "VK",
    label: "Специалист по внутренним системам водоснабжения и канализации",
  },
  {
    value: "SPO",
    label: "Специалист по системам пожаротушения и огнезащите",
  },
  {
    value: "OV",
    label: "Специалист по отоплению, вентиляции и кондиционированию",
  },
  {
    value: "VS",
    label: "Специалист по воздухоснабжению",
  },
  {
    value: "PU",
    label: "Специалист по пылеудалению",
  },
  {
    value: "HS",
    label: "Специалист по холодоснабжению",
  },
  {
    value: "TM",
    label: "Специалист по тепломеханическим решениям котельных и ТЭЦ",
  },
  {
    value: "TS",
    label: "Специалист по тепломеханическим решениям тепловых сетей",
  },
  {
    value: "PSS",
    label: "Специалист по проводным средствам связи",
  },
  {
    value: "RT",
    label: "Специалист по радиосвязи, радиовещанию и телевидению",
  },
  {
    value: "PS",
    label: "Специалист по пожарной сигнализации",
  },
  {
    value: "OS",
    label: "Специалист по охранной сигнализации",
  },
  {
    value: "GSN",
    label: "Специалист по наружным газопроводам",
  },
  {
    value: "GSV",
    label: "Специалист по газоснабжению (внутренние устройства)",
  },
  {
    value: "TH",
    label: "Специалист по технологии производства",
  },
  {
    value: "TK",
    label: "Специалист по технологическим коммуникациям",
  },
  {
    value: "AZO",
    label: "Специалист по антикоррозионной защите технологических аппаратов, "
      + "газоходов и трубопроводов",
  },
  {
    value: "TI",
    label: "Специалист по тепловой изоляции оборудования и трубопроводов",
  },
  {
    value: "AK",
    label: "Специалист по комплексной автоматизации",
  },
  {
    value: "GLS",
    label: "Специалист по гидромелиоративным линейным сооружениям",
  },
  {
    value: "SMZ",
    label: "Специалист по системам молниезащиты и заземления",
  },
  {
    value: "POS",
    label: "Специалист по проектам организации строительства",
  },
  {
    value: "OOS",
    label: "Специалист по мероприятиям по охране окружающей среды",
  },
  {
    value: "PB",
    label: "Специалист по мероприятиям по обеспечению пожарной безопасности",
  },
  {
    value: "ODI",
    label: "Специалист по мероприятиям по обеспечению доступа инвалидов",
  },
  {
    value: "TBE",
    label: "Специалист по требованиям к безопасной эксплуатации объектов строительства",
  },
  {
    value: "SM",
    label: "Специалист по сметам на строительство, реконструкцию и капитальный ремонт",
  },
  {
    value: "GOCHS",
    label: "Специалист по мероприятиям по гражданской обороне, предупреждению "
      + "чрезвычайных ситуаций и противодействию терроризму",
  },
  {
    value: "DPB",
    label: "Специалист по декларациям промышленной безопасности опасных производственных объектов",
  },
  {
    value: "DBG",
    label: "Специалист по декларациям безопасности гидротехнических сооружений",
  },
  {
    value: "OSD",
    label: "Специалист по организации работ по содержанию автомобильной дороги",
  },
  {
    value: "ODD",
    label: "Специалист по организации дорожного движения",
  },
  {
    value: "MOSOKN",
    label: "Специалист по мероприятиям по обеспечению сохранности объектов культурного наследия",
  },
  {
    value: "MRKZ",
    label: "Специалист по мероприятиям по рекультивации и консервации земель",
  },
  {
    value: "MVROL",
    label: "Специалист по мероприятиям по лесовосстановлению, лесоразведению или освоению лесов",
  },
  {
    value: "MSO",
    label: "Специалист по мероприятиям по сносу объектов",
  },
  {
    value: "MBT",
    label: "Специалист по мероприятиям по благоустройству территорий",
  },
  {
    value: "KRD",
    label: "Креативный директор / Арт-директор",
  },
  {
    value: "DL",
    label: "Дизайн-лид / Ведущий дизайнер",
  },
  {
    value: "DP",
    label: "Дизайнер-проектировщик",
  },
  {
    value: "DV",
    label: "Дизайнер-визуализатор / 3D-моделлер",
  },
  {
    value: "TS_DRAFTER",
    label: "Технический специалист / Чертёжник",
  },
  {
    value: "BIM_MANAGER",
    label: "BIM-менеджер (архитектор процессов)",
  },
  {
    value: "BIM_COORDINATOR",
    label: "BIM-координатор (контролёр качества)",
  },
  {
    value: "BIM_MODELER",
    label: "BIM-моделлер (создатель контента)",
  },
];
