import type { OrderDetailOption } from "../model/detail-option";

/** Названия экологических работ в условиях заказа. */
export const ECOLOGY_WORKS: OrderDetailOption[] = [
  {
    value: "КЭР",
    label: "Комплексное экологическое разрешение",
  },
  {
    value: "ПНООЛР",
    label: "Проект нормативов образования отходов и лимитов на их размещение",
  },
  {
    value: "НДВ",
    label: "Проект нормативов допустимых выбросов",
  },
  {
    value: "СЗЗ",
    label: "Проект санитарно-защитных зон",
  },
  {
    value: "ПЭК",
    label: "Осуществление производственного экологического контроля",
  },
  {
    value: "НДС",
    label: "Проект нормативов допустимых сбросов",
  },
  {
    value: "ОРО",
    label: "Мониторинг объектов размещения отходов",
  },
  {
    value: "РППВО",
    label: "Получение решения на право пользования водным объектом",
  },
  {
    value: "НВОС_П",
    label: "Постановка на учёт объекта негативного воздействия на окружающую среду",
  },
  {
    value: "НВОС_С",
    label: "Снятие с учёта объекта негативного воздействия на окружающую среду",
  },
  {
    value: "ПО",
    label: "Подготовка паспорта отходов",
  },
  {
    value: "ВРИ",
    label: "Разработка внутренних регламентов и инструкций",
  },
  {
    value: "ОФ",
    label: "Создание отчётных форм: 2-ТП (отходы), 2-ТП (воздух), 2-ТП (водхоз), "
      + "4-ОС, отчёт по ПЭК",
  },
];
